Table of Contents
 Class ScopeAwareObject
Namespace
IdeaStatiCa.BimApiLink.Scoping
Assembly
IdeaStatiCa.BimApiLink.dll
public abstract class ScopeAwareObject
Inheritance
object
ScopeAwareObject
Derived
BimLinkObject
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 ScopeAwareObject()
protected ScopeAwareObject()
 ScopeAwareObject(IScopeProvider)
protected ScopeAwareObject(IScopeProvider scopeProvider)
Parameters
scopeProvider IScopeProvider
Properties
 Scope
protected IScope Scope { get; }
Property Value
IScope
 Edit this page